Core/src/Enums/ОбработчикиДрайверовПодключаемогоОборудования/ОбработчикиДрайверовПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбработчикиДрайверовПодключаемогоОборудования</name>
  <enumValues>
    <name>Обработчик1СWebСервисОборудование</name>
    <comment>WebСервисОборудование</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СДисплейПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СККМOffline</name>
    <comment>ККМOffline</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СПринтерЧеков</name>
    <comment>ПринтерЧеков</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СРарусФискальныеРегистраторыМебиус</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СРарусФискальныеРегистраторыФеликс</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССканерыШтрихкодаNative</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССчитывателиМагнитныхКарт</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССчитывателиМагнитныхКартNative</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СФискальныйРегистраторЭмулятор</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СЭквайринговыеТерминалыСбербанк</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикACOMВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикARCUS2ЭквайринговыеТерминалыIngenico</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикCASВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикCASЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикERFIDСчитывательRFID</name>
    <comment>СчитывательRFID</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикIboxProПоддержкаMPosЭквайринга</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикIronLogicСчитывателиБесконтактныхКарт</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикISBCСчитывательRFID</name>
    <comment>СчитывательRFID</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикTRPOSЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикUCSEFTPOSЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАТОЛВесыСПечатьюЭтикеток8X</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолДисплеиПокупателя8X</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолККМOffline</name>
    <comment>ККМOffline</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолККТ54ФЗ</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСканерыШтрихкода8X</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСчитывателиМагнитныхКарт</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСчитывателиМагнитныхКарт8X</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолТерминалыСбораДанныхMobileLogistics</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолФискальныеРегистраторы8X</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолФискальныеРегистраторыУниверсальный</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолЭлектронныеВесы8X</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикВерсияТФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГАЗПРОМБАНКЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГексагонПринтераЭтикеток</name>
    <comment>ПринтерЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГексагонСканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГексагонТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикДримкасФискальныеРегистраторыVikiPrint</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикИНПАСЭквайринговыеТерминалыSmart</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикИНПАСЭквайринговыеТерминалыUNIPOS</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикИскраФискальныеРегистраторыПрим</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикККСДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикККСФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКлеверенсСчитывателиRFID</name>
    <comment>СчитывательRFID</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКлеверенсТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКристаллСервисДисплеиПокупателяVikiVision</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКристаллСервисФискальныеРегистраторыPirit</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикМассаКВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикМассаКЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикОРИОНФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСБРФЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодПринтераЭтикетокGodexEZPL8Native</name>
    <comment>ПринтерЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодСканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодСчитывательRFIDCipherLab</name>
    <comment>СчитывательRFID</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодТерминалыСбораДанныхNative</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканситиПринтераЭтикеток</name>
    <comment>ПринтерЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканситиТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМККМOffline</name>
    <comment>ККМOffline</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМККТ54ФЗ</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМПлатежныйТерминалYarus</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМФискальныеРегистраторыУниверсальный</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикОптимусФискальныйРегистратор</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикDATECSФискальныйРегистратор</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>СканерШтрихкода</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>ККТ</name>
    <comment>KKT</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЧеков</name>
    <comment>ReceiptPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭквайринговыйТерминал</name>
    <comment>AcquiringTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>ККМOffline</name>
    <comment>ECROffline</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЭтикеток</name>
    <comment>LabelPrinter</comment>
  </enumValues>
  <enumValues>
    <name>WebСервисОборудование</name>
  </enumValues>
  <enumValues>
    <name>СчитывательRFID</name>
    <comment>RFID</comment>
  </enumValues>
</mdclass:Enum>

Core/src/CommonModules/МенеджерОборудованияКлиентПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает текущую дату, приведенную к часовому поясу сеанса.
// Предназначена для использования вместо функции ТекущаяДата().
//
Функция ДатаСеанса() Экспорт
	
	Возврат ОбщегоНазначенияКлиент.ДатаСеанса();
	
КонецФункции

// Функция возвращает объект обработчика драйвера по его наименованию.
//
// Параметры:
//  ОбработчикДрайвера  - Перечисление, ссылка на обработчик драйвера подключаемого оборудования.
//  ЗагружаемыйДрайвер  - Булево, признак, что драйвер загружаемый
//  ТипОборудованияИмя  - Строка, представление типа оборудования
//
// Возвращаемое значение:
//  Результат - Используемый модуль обработчика драйвера.
//
Функция ПолучитьОбработчикДрайвера(ОбработчикДрайвера, ЗагружаемыйДрайвер, ТипОборудованияИмя) Экспорт

 // Используем универсальный обработчик драйвера по стандарту "1С:Совместимо".
#Если ВебКлиент Тогда
	Результат = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент; 
#Иначе
	Результат = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
#КонецЕсли
	
	// Обработчики драйверов не удовлетворяющие стандарту "1С:Совместимо".
	Если Не ЗагружаемыйДрайвер И ОбработчикДрайвера <> Неопределено Тогда
		
		// Сканеры штрихкода
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудование1ССканерыШтрихкодаКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодСканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудованиеСканкодСканерыШтрихкодаКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудованиеАтолСканерыШтрихкодаКлиент;
		КонецЕсли;
		// Конец Сканеры штрихкода
		
		// Считыватели магнитных карт
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССчитывателиМагнитныхКарт") Тогда
			Возврат ПодключаемоеОборудование1ССчитывателиМагнитныхКартКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСчитывателиМагнитныхКарт") Тогда
			Возврат ПодключаемоеОборудованиеАтолСчитывателиМагнитныхКартКлиент;
		КонецЕсли;
		// Конец Считыватели магнитных карт.

		// Фискальные регистраторы
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеАтолФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВерсияТФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеВерсияТФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикККСФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеККСФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеШтрихМФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикОРИОНФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеОРИОНФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикОптимусФискальныйРегистратор") Тогда
			Возврат ПодключаемоеОборудованиеОптимусФискальныйРегистратор;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикDATECSФискальныйРегистратор") Тогда
			Возврат ПодключаемоеОборудованиеDATECSФискальныеРегистраторыКлиент;	
		КонецЕсли;
		// Конец Фискальные регистраторы.
		
		// Дисплеи покупателя
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолДисплеиПокупателя") Тогда
			Возврат ПодключаемоеОборудованиеАтолДисплеиПокупателяКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодДисплеиПокупателя") Тогда
			Возврат ПодключаемоеОборудованиеСканкодДисплеиПокупателяКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМДисплеиПокупателя") Тогда
			Возврат ПодключаемоеОборудованиеШтрихМДисплеиПокупателяКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикККСДисплеиПокупателя") Тогда
			Возврат ПодключаемоеОборудованиеККСДисплеиПокупателяКлиент;
		КонецЕсли;                 
		// Конец Дисплеи покупателя
		
		// Терминалы сбора данных
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеАтолТерминалыСбораДанныхКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеШтрихМТерминалыСбораДанныхКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеСканкодТерминалыСбораДанныхКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканситиТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеСканситиТерминалыСбораДанныхКлиент;
		КонецЕсли;
		// Конец Терминалы сбора данных.
		
		// Эквайринговые терминалы
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСБРФЭквайринговыеТерминалы") Тогда
			Возврат ПодключаемоеОборудованиеСБРФЭквайринговыеТерминалыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикИНПАСЭквайринговыеТерминалыSmart") Тогда
			Возврат ПодключаемоеОборудованиеИНПАСЭквайринговыеТерминалыSmartКлиент;
		КонецЕсли;
		// Конец Эквайринговые терминалы.
		 
		// Электронные весы
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолЭлектронныеВесы") Тогда
			Возврат ПодключаемоеОборудованиеАтолЭлектронныеВесыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМЭлектронныеВесы") Тогда
			Возврат ПодключаемоеОборудованиеШтрихМЭлектронныеВесыКлиент;
		КонецЕсли;
		// Конец Электронные весы
		
		// Весы с печатью этикеток
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикACOMВесыСПечатьюЭтикеток") Тогда
			Возврат ПодключаемоеОборудованиеACOMВесыСПечатьюЭтикетокКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМВесыСПечатьюЭтикеток") Тогда
			Возврат ПодключаемоеОборудованиеШтрихМВесыСПечатьюЭтикетокКлиент;
		КонецЕсли;
		// Конец Весы с печатью этикеток.
		//
		// ККМ offline
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолККМOffline") Тогда
			Возврат ПодключаемоеОборудованиеАтолККМOfflineКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМККМOffline") Тогда
			Возврат ПодключаемоеОборудованиеШтрихМККМOfflineКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СККМOffline") Тогда
			Возврат ПодключаемоеОборудование1СККМOfflineКлиент;
		КонецЕсли;
		// Конец ККМ offline
		
		// Web-сервис оборудование
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СWebСервисОборудование") Тогда
			Возврат Неопределено;
		КонецЕсли;
		// Конец Web-сервис оборудование
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура отправляет электронное сообщение на электронную почта и абонентский номер.
//
Процедура НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер) Экспорт
	
	РассылкаЭлектронныхЧековКлиент.НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер);
	
КонецПроцедуры

#КонецОбласти
 
#Область РаботаСФормойЭкземпляраОборудования

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриОткрытии".
//
Процедура ЭкземплярОборудованияПриОткрытии(Объект, ЭтаФорма, Отказ) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗакрытием".
//
Процедура ЭкземплярОборудованияПередЗакрытием(Объект, ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписью".
//
Процедура ЭкземплярОборудованияПередЗаписью(Объект, ЭтаФорма, Отказ, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписи".
//
Процедура ЭкземплярОборудованияПослеЗаписи(Объект, ЭтаФорма, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ТипОборудованияОбработкаВыбора".
//
Процедура ЭкземплярОборудованияТипОборудованияВыбор(Объект, ЭтаФорма, ЭтотОбъект, Элемент, ВыбранноеЗначение) Экспорт
	
	// Доступ к узлу есть только для соответствующего оборудования.
	ЭтаФорма.Элементы.ПравилоОбмена.Видимость = Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККМOffline")
		ИЛИ Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток")
		ИЛИ Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.WebСервисОборудование");
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойНастройкиWebServiceОборудования

// Дополнительные переопределяемые действия с управляемой формой в Форме настройки Web-cервис оборудования
// при событии "ПриСозданииНаСервере".
//
Процедура ФормаНастройкиWebСервисОборудованияПриОткрытии(Идентификатор, ЭтаФорма, Отказ) Экспорт
	
КонецПроцедуры

#КонецОбласти
